#language: ru

@tree

Функционал: проверка добавления картинок в справочник Номенклатура

Как Менеджер я хочу
добавить картинки к Номенклатуре 
чтобы можно было посмотреть как выглядит товар 

Контекст:
    Дано Я открыл новый сеанс TestClient или подключил уже существующий
    
Сценарий: _0601 подготовительный (добавление картинок)
	Когда экспорт основных данных
    Когда экспорт настроек картинок
    И я закрываю TestClient "Этот клиент"
    И я устанавливаю в базу расширение из файла "$КаталогПроекта$\Additional\IRP_TestExtension.cfe"
    И я подключаю профиль TestClient "Этот клиент"

Сценарий: _0602 проверка добавления картинок
    Дано Я открываю навигационную ссылку "e1cib/data/Catalog.Items?ref=b762b13668d0905011eb766bf96b2752"    
    И я выбираю файл "$КаталогПроекта$\Files\itempicture1.png"
    И Пауза 1
    И я делаю клик по элементу клиента тестирования '+' UI Automation
    И я нажимаю на кнопку с именем 'update_slider'